In [29]:
from IPython.core.display import display, HTML
display(HTML("<style>.container { width:100% !important; }</style>"))

In [69]:
import pandas as pd

In [70]:
data = [['tom', 10, 'C', 'history'],
        ['tom', 26, 'A', 'geography'],
        ['tom', 10, 'A', 'maths'],
        ['nick', 15, 'B', 'english'], 
        ['nick', 19, 'B', 'english'], 
        ['nick', 25, 'C', 'maths'], 
        ['juli', 14, 'A', 'english'],
        ['tom', 25, 'C', 'maths'], 
       ] 
  
# Create the pandas DataFrame 
df = pd.DataFrame(data, columns = ['name', 'marks', 'grade', 'subject']) 
  
# print dataframe. 
df

   name  marks grade    subject
0   tom     10     C    history
1   tom     26     A  geography
2   tom     10     A      maths
3  nick     15     B    english
4  nick     19     B    english
5  nick     25     C      maths
6  juli     14     A    english
7   tom     25     C      maths

In [71]:
from sqlalchemy import create_engine

POSTGRES_USERNAME = "sahil"
POSTGRES_PASSWORD = "Asdf1994!"
POSTGRES_DBNAME = "postgres"
POSTGRES_HOST = "postgresdb2.cznthudneeub.eu-west-1.rds.amazonaws.com"

url = 'postgresql://{}:{}@{}:{}/{}'.format(POSTGRES_USERNAME, POSTGRES_PASSWORD, POSTGRES_HOST, 5432, POSTGRES_DBNAME)
print(url)
engine = create_engine(url)

postgresql://sahil:Asdf1994!@postgresdb2.cznthudneeub.eu-west-1.rds.amazonaws.com:5432/postgres

In [83]:
df.to_sql("students", if_exists='replace', con=engine, index=False)

### List all tables in Database

In [112]:
query = """ SELECT table_name FROM information_schema.tables WHERE table_schema = 'public'; """
ans = pd.read_sql_query(query, con=engine)
ans.head(50)

           table_name
0  table_from_docker2
1       queries_table
2  table_from_docker3
3         house_price
4            students
5               games

### Select everything from table

In [84]:
query = 'select * from students;'
ans = pd.read_sql_query(query, con=engine)
ans.head(50)

   name  marks grade    subject
0   tom     10     C    history
1   tom     26     A  geography
2   tom     10     A      maths
3  nick     15     B    english
4  nick     19     B    english
5  nick     25     C      maths
6  juli     14     A    english
7   tom     25     C      maths

### Insert into Table

In [85]:
query = """INSERT INTO students("name", "marks", "grade", subject) \
    VALUES ('gen', 29, 'A', 'geography');"""
engine.execute(query)

### Output Data using constraint

In [86]:
query = """select * from students where subject like 'maths'"""
ans = pd.read_sql_query(query, con=engine) 
ans.head(50)

   name  marks grade subject
0   tom     10     A   maths
1  nick     25     C   maths
2   tom     25     C   maths

In [87]:
query = """select * from students where subject like 'maths' and marks <25 """
ans = pd.read_sql_query(query, con=engine) 
ans.head(50)

  name  marks grade subject
0  tom     10     A   maths

### Outputting Sorted Dat

In [88]:
query = '''select * from students where marks > 20 order by "subject" '''
ans = pd.read_sql_query(query, con=engine)
ans.head(50)

   name  marks grade    subject
0   tom     26     A  geography
1   gen     29     A  geography
2  nick     25     C      maths
3   tom     25     C      maths

### Count number of rows

In [89]:
query = """ select count(*) from students; """
ans = pd.read_sql_query(query, con=engine)
ans

   count
0      9

### Data Manipulation Using AVG

In [90]:
query = """ select name, avg(marks) from students group by name; """
ans = pd.read_sql_query(query, con=engine)
ans

   name        avg
0  nick  19.666667
1   tom  17.750000
2   gen  29.000000
3  juli  14.000000

### Create View

In [122]:
query = """ CREATE  OR REPLACE VIEW Failing_Students AS
            SELECT name, marks, subject
            FROM students
            WHERE marks < 22; 
        """
engine.execute(query)
# ans = pd.read_sql_query(query, con=engine)
# ans.head()

### Query for Listing all Views

In [123]:
query = """   select table_name from INFORMATION_SCHEMA.views WHERE table_schema = ANY (current_schemas(false)); """
ans = pd.read_sql_query(query, con=engine)
ans

         table_name
0  failing_students

### Update view

In [125]:
query = """SELECT * FROM Failing_Students; """
ans = pd.read_sql_query(query, con=engine)
ans.head(50)

   name  marks subject
0   tom     10       C
1   tom     10       A
2  nick     15       B
3  nick     19       B
4  juli     14       A
5  gabe      5   maths

### Drop view

In [94]:
query = """ DROP VIEW failing_students; """
ans = engine.execute(query)


### Swap values of 2 columns

In [95]:
query = """ UPDATE students set subject=grade, grade=subject; """
ans=engine.execute(query)
ans
# ans.head(50)

In [97]:
pd.read_sql_table('students', con=engine).head(50)

   name  marks      grade subject
0   tom     10    history       C
1   tom     26  geography       A
2   tom     10      maths       A
3  nick     15    english       B
4  nick     19    english       B
5  nick     25      maths       C
6  juli     14    english       A
7   tom     25      maths       C
8   gen     29  geography       A

### unique values for a column

In [101]:
query = """ select distinct(grade) from students; """
ans=pd.read_sql_query(query, engine)
ans.head(50)

       grade
0  geography
1    english
2    history
3      maths

### Making a Top 25 with the SELECT TOP Clause

In [105]:
query = """ select * from students order by marks desc limit 3; """
ans=pd.read_sql_query(query, engine)
ans.head(50)

   name  marks      grade subject
0   gen     29  geography       A
1   tom     26  geography       A
2  nick     25      maths       C

### Join of 2 tables

In [116]:
data = [['baseball', 10, 'Yes', 'monday', 'juli'],
        ['GAA', 8, 'No', 'tueday', 'ron'],
        ['baseball', 4, 'Yes', 'saturday', 'nick'],
        ['football', 1, 'No', 'sunday', 'simon'],
        ['football', 6, 'Yes', 'thursday', 'tom'],
       ] 
  
# Create the pandas DataFrame 
df = pd.DataFrame(data, columns = ['game', 'performance', 'for_fun', 'day', 'name']) 
  

# save table to database
df.to_sql('games', if_exists='replace', con=engine)

# print dataframe. 
df

       game  performance for_fun       day   name
0  baseball           10     Yes    monday   juli
1       GAA            8      No    tueday    ron
2  baseball            4     Yes  saturday   nick
3  football            1      No    sunday  simon
4  football            6     Yes  thursday    tom

In [119]:
query = """ select * from students INNER JOIN games ON students.name = games.name; """
ans=pd.read_sql_query(query, engine)
ans.head(50)

,name,marks,grade,subject,index,game,performance,for_fun,day,name
0,tom,10,history,C,4,football,6,Yes,thursday,tom
1,tom,26,geography,A,4,football,6,Yes,thursday,tom
2,tom,10,maths,A,4,football,6,Yes,thursday,tom
3,nick,15,english,B,2,baseball,4,Yes,saturday,nick
4,nick,19,english,B,2,baseball,4,Yes,saturday,nick
5,nick,25,maths,C,2,baseball,4,Yes,saturday,nick
6,juli,14,english,A,0,baseball,10,Yes,monday,juli
7,tom,25,maths,C,4,football,6,Yes,thursday,tom

### Union of 2 tables

In [126]:
data = [['baseball', 4, 'Yes', 'monday', 'julianne'],
        ['GAA', 2, 'No', 'tueday', 'fontinal'],
        ['batminton', 0, 'Yes', 'saturday', 'roman'],
        ['frizbee', 3, 'No', 'sunday', 'elize'],
        ['cricket', 6, 'Yes', 'thursday', 'gary'],
       ] 
  
# Create the pandas DataFrame 
df = pd.DataFrame(data, columns = ['game', 'performance', 'for_fun', 'day', 'name']) 
  

# save table to database
df.to_sql('games2', if_exists='replace', con=engine)

# print dataframe. 
df

        game  performance for_fun       day      name
0   baseball            4     Yes    monday  julianne
1        GAA            2      No    tueday  fontinal
2  batminton            0     Yes  saturday     roman
3    frizbee            3      No    sunday     elize
4    cricket            6     Yes  thursday      gary

In [127]:
query = """ SELECT * FROM games
            UNION
            SELECT * FROM games2; """
ans = pd.read_sql_query(query, con=engine)
ans.head(50)

   index       game  performance for_fun       day      name
0      0   baseball            4     Yes    monday  julianne
1      4    cricket            6     Yes  thursday      gary
2      0   baseball           10     Yes    monday      juli
3      1        GAA            8      No    tueday       ron
4      3    frizbee            3      No    sunday     elize
5      2   baseball            4     Yes  saturday      nick
6      2  batminton            0     Yes  saturday     roman
7      4   football            6     Yes  thursday       tom
8      3   football            1      No    sunday     simon
9      1        GAA            2      No    tueday  fontinal

### Create Index

In [132]:
query = """CREATE INDEX subject_index 
            ON students(subject); """
engine.execute(query)

### When Should Indexes be Avoided?
Although indexes are intended to enhance a database's performance, there are times when they should be avoided. The following guidelines indicate when the use of an index should be reconsidered −

* Indexes should not be used on small tables.

* Tables that have frequent, large batch update or insert operations.

* Indexes should not be used on columns that contain a high number of NULL values.

* Columns that are frequently manipulated should not be indexed.

### Multi Column Index

In [ ]:
### 
### Dont RUN`
###

query = """ CREATE INDEX index_name 
            ON table_name (column1_name, column2_name); """
engine.execute(query, engine)

### Partial Index

In [ ]:
###
### DOnt RUN
###

query = """CREATE INDEX index_name
           on table_name (conditional_expression);"""
engine.execute(query, engine)

### Implicit Indexes

Implicit indexes are indexes that are automatically created by the database server when an object is created. Indexes are automatically created for primary key constraints and unique constraints.

### Copying Selections from Table to Table

There are a hundred and one uses for this SQL tool. Suppose you want to archive your yearly Orders table into a larger archive table.

In [ ]:
###
### Dont RUN
###

query = """ INSERT INTO Yearly_Orders 
            SELECT * FROM Orders 
            WHERE Date<=1/1/2018; """
engine.execute(query, engine)

### Demo for superset

In [200]:
query = """ CREATE  OR REPLACE VIEW all_student_data AS
            select students.name, students.marks, students.grade, students.subject, games.game, games.performance, games.for_fun, games.day 
            from students 
            INNER JOIN games ON students.name = games.name; """
engine.execute(query, engine)
# ans=pd.read_sql_query(query, engine)
# ans.head(50)

ProgrammingError: (psycopg2.errors.InvalidTableDefinition) cannot change name of view column "game" to "index"

[SQL:  CREATE  OR REPLACE VIEW all_student_data AS
            select *
            from students
            INNER JOIN games ON students.name = games.name; ]
[parameters: (Engine(postgresql://sahil:***@postgresdb2.cznthudneeub.eu-west-1.rds.amazonaws.com:5432/postgres),)]
(Background on this error at: http://sqlalche.me/e/f405)

In [188]:
query = """ insert into students(name, marks, grade, subject) values('geodel', 0, '', ''); """
engine.execute(query, engine)

In [224]:
pd.read_sql_query("select * from students order by marks;", engine).head(50)

       name  marks      grade    subject
0    geodel      0          C      maths
1      gabe      2          C      stats
2    joshua      4          C      maths
3     simon      4          C  geography
4     reddy      4          C      maths
5      gabe      5          D      maths
6       tom     10      maths          A
7       tom     10    history          C
8       gen     12          B      stats
9      juli     14    english          A
10    reddy     14          B  geography
11     nick     15    english          B
12      sam     16          B    spanish
13      tom     17          B      stats
14     nick     19    english          B
15    panda     24          A      stats
16      tom     25      maths          C
17     nick     25      maths          C
18      tom     26  geography          A
19    simon     28          A      stats
20      gen     29  geography          A
21  gregory     29          A     french

In [225]:
pd.read_sql_query("select * from games order by name;", engine).head(50)

        game  performance for_fun        day     name
0    cricket            8      No  wednesday      gen
1     tennis           10     Yes  wednesday   goedel
2        GAA           10     Yes  wednesday   goedel
3      rugby            8     Yes  wednesday   goedel
4    frizbee            8      No  wednesday  gregory
5       None            4     Yes    tuesday   joshua
6   baseball           10     Yes     monday     juli
7   baseball            4     Yes   saturday     nick
8       None            6     Yes    tuesday    panda
9        GAA            8      No     tueday      ron
10   frizbee            8      No    tuesday      sam
11  football            1      No     sunday    simon
12   frizbee            6     Yes   thursday      tom

In [228]:
pd.read_sql_query("select * from all_student_data order by name;", engine).head(50)

,name,marks,grade,subject,game,performance,for_fun,day
0,gen,12,B,stats,cricket,8,No,wednesday
1,gen,29,geography,A,cricket,8,No,wednesday
2,goedel,0,C,maths,GAA,10,Yes,wednesday
3,goedel,0,C,maths,rugby,8,Yes,wednesday
4,goedel,0,C,maths,tennis,10,Yes,wednesday
5,gregory,29,A,french,frizbee,8,No,wednesday
6,joshua,4,C,maths,None,4,Yes,tuesday
7,juli,14,english,A,baseball,10,Yes,monday
8,nick,15,english,B,baseball,4,Yes,saturday
9,nick,25,maths,C,baseball,4,Yes,saturday
10,nick,19,english,B,baseball,4,Yes,saturday
11,panda,24,A,stats,None,6,Yes,tuesday
12,sam,16,B,spanish,frizbee,8,No,tuesday
13,simon,4,C,geography,football,1,No,sunday
14,simon,28,A,stats,football,1,No,sunday
15,tom,10,history,C,frizbee,6,Yes,thursday
16,tom,26,geography,A,frizbee,6,Yes,thursday
17,tom,10,maths,A,frizbee,6,Yes,thursday
18,tom,25,maths,C,frizbee,6,Yes,thursday
19,tom,17,B,stats,frizbee,6,Yes,thursday

In [220]:
query = """ insert into games(index ,name,performance, for_fun, day, game) values(1, 'goedel', 10, 'Yes', 'wednesday','tennis'); """
engine.execute(query)

In [158]:
df1 = pd.read_sql_table('students', engine)
df2 = pd.read_sql_table('games', engine)

ans = pd.merge(df1, df2, on='name', how='left')
ans.head(50)

,name,marks,grade,subject,index,game,performance,for_fun,day
0,tom,10,history,C,4.0,football,6.0,Yes,thursday
1,tom,26,geography,A,4.0,football,6.0,Yes,thursday
2,tom,10,maths,A,4.0,football,6.0,Yes,thursday
3,nick,15,english,B,2.0,baseball,4.0,Yes,saturday
4,nick,19,english,B,2.0,baseball,4.0,Yes,saturday
5,nick,25,maths,C,2.0,baseball,4.0,Yes,saturday
6,juli,14,english,A,0.0,baseball,10.0,Yes,monday
7,tom,25,maths,C,4.0,football,6.0,Yes,thursday
8,gen,29,geography,A,NaN,NaN,NaN,NaN,NaN
9,gabe,5,D,maths,NaN,NaN,NaN,NaN,NaN
10,simon,4,C,geography,3.0,football,1.0,No,sunday
11,joshua,4,C,maths,11.0,None,4.0,Yes,tuesday
12,reddy,4,C,maths,NaN,NaN,NaN,NaN,NaN

In [227]:
# query = """ update  games set performance=6 where performance=5 """
# query = """ update  students set grade='C' where name like 'geodel' ;"""
query = """ update  students set name='goedel' where name like 'geodel' ;"""
engine.execute(query, engine)

In [223]:
query = """ alter table games drop column index """
engine.execute(query, engine)